<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest ThinLinc client for OS X.</string>
    <key>Identifier</key>
    <string>com.github.gregneagle.download.thinlincclient</string>
    <key>Input</key>
    <dict>
        <key>BASE_DOWNLOAD_URL</key>
        <string>http://www.cendio.com/downloads/clients/</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>ThinLincClientURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>base_url</key>
                <string>%BASE_DOWNLOAD_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
